"I have read and agree to the WPS Office License Agreement and the Privacy Policy." = "He leído y acepto el Contrato de licencia de WPS Office y la Política de privacidad.";

"WPS Office License Agreement" = "Contrato de licencia de WPS Office";

"Privacy Policy" = "Política de privacidad";

"Download failed, please check the network" = "La descarga falló, por favor revise la red.";

"manual install" = "Instalación manual";

"Retry" = "Rever";

"Install Now" = "Instalar ahora";

"Installation failed, please check if the system has enough memory space." = "La instalación falló. Compruebe si su sistema tiene suficiente memoria.";

"Installation failed, please close the running WPS Office." = "La instalación falló; cierre la aplicación WPS Office en ejecución.";

"Installing, please wait..." = "WPS Office se está descargando...";

"Language" = "Idioma";

"All-in-One OfficeSuite with PDFEditor. Now with AI" = "Suite de oficina y PDF potenciada por IA para todos";

"Cancel" = "Cancelar";

"Tip" = "pista";

"Confirm" = "confirmar";

"In accordance with relevant policy requirements, for a better experience with WPS Office services, please read and agree to the License Agreement and Privacy Policy." = "De acuerdo con los requisitos de política pertinentes, para una mejor experiencia con los servicios de WPS Office, lea y acepte el Acuerdo de licencia y la Política de privacidad.";

"License Agreement" = "Acuerdo de licencia";

"Create infinite possibilities" = "Crea infinitas posibilidades";

"Installing WPS Office" = "Instalación de WPS Office...";

"Before installing, please close the running WPS Office." = "Antes de instalar, cierre el WPS Office que esté ejecutándose.";